app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.all_ratings
    @sort = params[:sort] || session[:sort]
    @ratings = params[:ratings] || session[:ratings] || all_ratings
    @movies = Movie.where( { rating: @ratings.keys } ).order( @sort )
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY release_date